n5/src/Catalogs/CustomsCharges/CustomsCharges.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CustomsCharges</name>
  <attributes>
    <name>Percent</name>
    <type>
      <types>DefinedType.Percent</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.CustomsCharges</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>CatalogRef.VAT</types>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/Catalogs/CustomsCharges/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|VAT enable Object.Type = Enum.CustomsCharges.VAT;
	|Percent enable Object.Type <> Enum.CustomsCharges.VAT
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure TypeOnChange ( Item )
	
	applyType ();
	
EndProcedure

&AtClient
Procedure applyType () 

	type = Object.Type;
	Object.Description = String ( type );
	if ( type <> PredefinedValue ( "Enum.CustomsCharges.VAT" ) ) then
		Object.VAT = undefined;
	endif;
	Appearance.Apply ( ThisObject, "Object.Type" );

EndProcedure

&AtClient
Procedure VATOnChange ( Item )
	
	applyVAT ();
	
EndProcedure

&AtClient
Procedure applyVAT () 

	Object.Percent = DF.Pick ( Object.VAT, "Rate" );

EndProcedure
